Revit 2027 API
BuiltInFailures.CurtainWallFailures.GridOutsideWall Property
 Curtain wall grid lines are outside wall. If you are trying to shorten the wall, please remove grid lines, including mullions on top of them.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId GridOutsideWall { get; }
Public Shared ReadOnly Property GridOutsideWall As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ GridOutsideWall {
	FailureDefinitionId^ get ();
}
static member GridOutsideWall : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CurtainWallFailures Class
Autodesk.Revit.DB Namespace